# SetAngularRadius Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AngularDimension..::..SetAngularRadius Method
AngularDimension Class See Also
---
Set radius of an Angular Dimension arc. The new radius of the arc.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void SetAngularRadius(
	double radius
)
```

Visual Basic
---
```text
Public Sub SetAngularRadius ( _
	radius As Double _
)
```

Visual C++
---
```text
public:
void SetAngularRadius(
	double radius
)
```

# ### Parameters
radius
    Type: System..::..Double
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for radius must be non-negative. |

# See Also
AngularDimension Class
Autodesk.Revit.DB Namespace